
#1.Поработайте с переменными, создайте
#несколько, выведите на экран, запросите
#у пользователя несколько чисел и строк и
#сохраните в переменные, выведите на экран.
a = 3
b = 4
c = 'Hello'
d = 2.45
e = True
print(a)
print(b)
print(c)
print(d)
print(e)
a = int(input('Введите первое целое число = '))
b = int(input('Введите второе целое число = '))
print('Первое число', a)
print('Второе число', b)
str_1 = input('Введите слово или строку один ')
str_2 = input('Введите слово или строку два ')
print(str_1)
print(str_2)
